resume.org
#+title: Resume
#+email: juntunen.kc@gmail.com
#+options: num:nil toc:nil ':t title:nil
| / |    <r> | <l>                           |
|   |   Name | K. C. Juntunen                |
|   |  Email | [[mailto:juntunen.kc@gmail.com][juntunen.kc@gmail.com]]         |
|   | Github | [[https://github.com/kcjuntunen][https://github.com/kcjuntunen]] |

* Projects
** Redbrick
A SolidWorks Add-In that manages part properties and integrates with
Amstore's databases and ECR process. Coded in C# .NET and a little
C++/CLR.
- [[https://github.com/kcjuntunen/Redbrick-Addin][https://github.com/kcjuntunen/Redbrick-Addin]]
** Fixture monitor
A Python application that collects readings from an Arduino, and
stores them in a MongoDB database. Data was visualized through a web
interface using [[https://github.com/django/django][Django]].
- [[https://github.com/kcjuntunen/fmon][https://github.com/kcjuntunen/fmon]]
** PDF Archiver
A C# SolidWorks macro that creates, from drawings, PDFs, and eDrawing documents,
among other things. Now migrated into the Redbrick project
- [[https://github.com/kcjuntunen/ArchivePDF][https://github.com/kcjuntunen/ArchivePDF]]
** Drawing Collector
A SolidWorks Macro that recursively steps through BOMs to find all
drawings and stitches them together in a PDF packet using [[https://github.com/itext/itextsharp][iTextSharp]].
- [[https://github.com/kcjuntunen/DrawingCollector][https://github.com/kcjuntunen/DrawingCollector]]
* Experience
** 2014-Current
Machine programmer/Software developer - Amstore Corp.
** 2013-2014
Engineer/Machine Programmer - Amstore Corp.
** 2012-2013
Team Leader, Shear/Press operator - Amstore Comp.
* Education
** 2008-2009
Baker College, CS Major
* Skills
|       <r> | <l>                                    |
|     Linux | Linux user since 1996                  |
|       C++ | Studied in college                     |
|        C# | Developed Solidworks AddIns/Macros     |
|    Python | Quick scripts and full applications    |
|       VBA | The old way of doing SolidWorks macros |
|     Shell | Bash, eshell                           |
|       Web | HTML5, CSS3, PHP                       |
| Databases | MySQL/Mariadb, Microsoft SQ, MongoDB   |
| Dev Tools | Git, Emacs, Visual Studio, TDD         |
|   Servers | Eve, Apache, Lighttp                   |
