resume.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-08-15 Mon 12:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Resume</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="K. C. Juntunen" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css" />
</head>
<body>
<div id="content">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Name</td>
<td class="org-left">K. C. Juntunen</td>
</tr>

<tr>
<td class="org-right">Email</td>
<td class="org-left"><a href="mailto:juntunen.kc@gmail.com">juntunen.kc@gmail.com</a></td>
</tr>

<tr>
<td class="org-right">Github</td>
<td class="org-left"><a href="https://github.com/kcjuntunen"><a href="https://github.com/kcjuntunen">https://github.com/kcjuntunen</a></a></td>
</tr>
</tbody>
</table>

<div id="outline-container-org21c03c4" class="outline-2">
<h2 id="org21c03c4">Projects</h2>
<div class="outline-text-2" id="text-org21c03c4">
</div><div id="outline-container-org2590271" class="outline-3">
<h3 id="org2590271">Redbrick</h3>
<div class="outline-text-3" id="text-org2590271">
<p>
A SolidWorks Add-In that manages part properties and integrates with
Amstore&rsquo;s databases and ECR process. Coded in C# .NET and a little
C++/CLR.
</p>
<ul class="org-ul">
<li><a href="https://github.com/kcjuntunen/Redbrick-Addin"><a href="https://github.com/kcjuntunen/Redbrick-Addin">https://github.com/kcjuntunen/Redbrick-Addin</a></a></li>
</ul>
</div>
</div>
<div id="outline-container-orge8ea08e" class="outline-3">
<h3 id="orge8ea08e">Fixture monitor</h3>
<div class="outline-text-3" id="text-orge8ea08e">
<p>
A Python application that collects readings from an Arduino, and
stores them in a MongoDB database. Data was visualized through a web
interface using <a href="https://github.com/django/django">Django</a>.
</p>
<ul class="org-ul">
<li><a href="https://github.com/kcjuntunen/fmon"><a href="https://github.com/kcjuntunen/fmon">https://github.com/kcjuntunen/fmon</a></a></li>
</ul>
</div>
</div>
<div id="outline-container-orgcb54f84" class="outline-3">
<h3 id="orgcb54f84">PDF Archiver</h3>
<div class="outline-text-3" id="text-orgcb54f84">
<p>
A C# SolidWorks macro that creates, from drawings, PDFs, and eDrawing documents,
among other things. Now migrated into the Redbrick project
</p>
<ul class="org-ul">
<li><a href="https://github.com/kcjuntunen/ArchivePDF"><a href="https://github.com/kcjuntunen/ArchivePDF">https://github.com/kcjuntunen/ArchivePDF</a></a></li>
</ul>
</div>
</div>
<div id="outline-container-orgef19684" class="outline-3">
<h3 id="orgef19684">Drawing Collector</h3>
<div class="outline-text-3" id="text-orgef19684">
<p>
A SolidWorks Macro that recursively steps through BOMs to find all
drawings and stitches them together in a PDF packet using <a href="https://github.com/itext/itextsharp">iTextSharp</a>.
</p>
<ul class="org-ul">
<li><a href="https://github.com/kcjuntunen/DrawingCollector"><a href="https://github.com/kcjuntunen/DrawingCollector">https://github.com/kcjuntunen/DrawingCollector</a></a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org080f427" class="outline-2">
<h2 id="org080f427">Experience</h2>
<div class="outline-text-2" id="text-org080f427">
</div><div id="outline-container-orgdf1dc57" class="outline-3">
<h3 id="orgdf1dc57">2014-Current</h3>
<div class="outline-text-3" id="text-orgdf1dc57">
<p>
Machine programmer/Software developer - Amstore Corp.
</p>
</div>
</div>
<div id="outline-container-org6842ea5" class="outline-3">
<h3 id="org6842ea5">2013-2014</h3>
<div class="outline-text-3" id="text-org6842ea5">
<p>
Engineer/Machine Programmer - Amstore Corp.
</p>
</div>
</div>
<div id="outline-container-orgb949eb2" class="outline-3">
<h3 id="orgb949eb2">2012-2013</h3>
<div class="outline-text-3" id="text-orgb949eb2">
<p>
Team Leader, Shear/Press operator - Amstore Comp.
</p>
</div>
</div>
</div>
<div id="outline-container-org0d5dfe5" class="outline-2">
<h2 id="org0d5dfe5">Education</h2>
<div class="outline-text-2" id="text-org0d5dfe5">
</div><div id="outline-container-org4ed5242" class="outline-3">
<h3 id="org4ed5242">2008-2009</h3>
<div class="outline-text-3" id="text-org4ed5242">
<p>
Baker College, CS Major
</p>
</div>
</div>
</div>
<div id="outline-container-org236cf7b" class="outline-2">
<h2 id="org236cf7b">Skills</h2>
<div class="outline-text-2" id="text-org236cf7b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Linux</td>
<td class="org-left">Linux user since 1996</td>
</tr>

<tr>
<td class="org-right">C++</td>
<td class="org-left">Studied in college</td>
</tr>

<tr>
<td class="org-right">C#</td>
<td class="org-left">Developed Solidworks AddIns/Macros</td>
</tr>

<tr>
<td class="org-right">Python</td>
<td class="org-left">Quick scripts and full applications</td>
</tr>

<tr>
<td class="org-right">VBA</td>
<td class="org-left">The old way of doing SolidWorks macros</td>
</tr>

<tr>
<td class="org-right">Shell</td>
<td class="org-left">Bash, eshell</td>
</tr>

<tr>
<td class="org-right">Web</td>
<td class="org-left">HTML5, CSS3, PHP</td>
</tr>

<tr>
<td class="org-right">Databases</td>
<td class="org-left">MySQL/Mariadb, Microsoft SQ, MongoDB</td>
</tr>

<tr>
<td class="org-right">Dev Tools</td>
<td class="org-left">Git, Emacs, Visual Studio, TDD</td>
</tr>

<tr>
<td class="org-right">Servers</td>
<td class="org-left">Eve, Apache, Lighttp</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: K. C. Juntunen</p>
<p class="date">Created: 2016-08-15 Mon 12:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
